In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
dic = {1:"Rayan", 2:"Ahmed", 3:"Eyad"}
ser = pd.Series(dic)
ser

1    Rayan
2    Ahmed
3     Eyad
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
ser.index = [11,12,13]
ser

11    Rayan
12    Ahmed
13     Eyad
dtype: object

## Q3: Retrieve First and second elements.

In [4]:
ser[0:2]

11    Rayan
12    Ahmed
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [39]:
s = pd.Series({14:"Rayan"})
ser = ser.append(s)
print(ser, end="\n \n")
ser = ser.drop_duplicates()
print(ser)

11    Rayan
12    Ahmed
13     Eyad
14    Rayan
dtype: object

11    Rayan
12    Ahmed
13     Eyad
dtype: object

C:\Users\Rayan\AppData\Local\Temp\ipykernel_1052\1822168672.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser = ser.append(s)

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [30]:
df = pd.DataFrame(columns=['ID', 'Name', 'GPA'])
df

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:
educ = pd.read_csv('educ_figdp_1_Data.csv')
educ.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [37]:
#loc
educ.loc[50:55]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
50,2002,Euro area (17 countries),Total public expenditure on education as % of ...,4.86,e
51,2003,Euro area (17 countries),Total public expenditure on education as % of ...,4.89,e
52,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
53,2005,Euro area (17 countries),Total public expenditure on education as % of ...,4.72,e
54,2006,Euro area (17 countries),Total public expenditure on education as % of ...,4.69,e
55,2007,Euro area (17 countries),Total public expenditure on education as % of ...,4.79,e

In [38]:
#slice 
educ[50:55]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
50,2002,Euro area (17 countries),Total public expenditure on education as % of ...,4.86,e
51,2003,Euro area (17 countries),Total public expenditure on education as % of ...,4.89,e
52,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
53,2005,Euro area (17 countries),Total public expenditure on education as % of ...,4.72,e
54,2006,Euro area (17 countries),Total public expenditure on education as % of ...,4.69,e